# Real-world Data Wrangling
### Fullname: Trương Hoàng Quốc Đạt
### ID: 21IT127
### Class: 21JIT

## 1. Gather data

### **1.1.** Problem Statement

This project aims to practice my skills of data wrangling using real-world datasets. 

Your statements here

In this dataset, I would like to answer the following research questions:

Question 1: Có bao nhiêu nhà có số lượng phòng ngủ lớn hơn 1

Question 2: Có bao nhiêu nhà có số lượng phòng tắm là 0

### **1.2.** Gather at least two datasets using two different data gathering methods

Gather each of the 2 pieces of data from different sources:

In [153]:
# import libraries:
import pandas as pd
import numpy as np

In [154]:
#FILL IN 1st data gathering and loading method
df_listing = pd.read_csv('listing.csv')
df_listing.head(3)

,id,name,summary,space,description,host_id,host_name,neighbourhood_group_cleansed,city,country_code,...,property_type,room_type,accommodates,bathrooms,bedrooms,beds,bed_type,amenities,square_feet,price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,Make your self at home in this charming one-be...,956883,Maija,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,$85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",Chemically sensitive? We've removed the irrita...,5177328,Andrea,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",NaN,$150.00
2,3308979,New Modern House-Amazing water view,New modern house built in 2013. Spectacular s...,"Our house is modern, light and fresh with a wa...",New modern house built in 2013. Spectacular s...,16708587,Jill,Queen Anne,Seattle,US,...,House,Entire home/apt,11,4.5,5.0,7.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,$975.00

In [155]:
#FILL IN 2nd data gathering and loading method
df_reviews = pd.read_csv('reviews.csv')
df_reviews.head(3)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,7202016,38917982,7/19/2015,28943674,Bianca,Cute and cozy place. Perfect location to every...
1,7202016,39087409,7/20/2015,32440555,Frank,Kelly has a great room in a very central locat...
2,7202016,39820030,7/26/2015,37722850,Ian,"Very spacious apartment, and in a great neighb..."

In [156]:
# Write data to local file

## 2. Assess data

### Issue 1:

In [157]:
df_listing.head(2)

,id,name,summary,space,description,host_id,host_name,neighbourhood_group_cleansed,city,country_code,...,property_type,room_type,accommodates,bathrooms,bedrooms,beds,bed_type,amenities,square_feet,price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,Make your self at home in this charming one-be...,956883,Maija,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,$85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",Chemically sensitive? We've removed the irrita...,5177328,Andrea,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",NaN,$150.00

In [158]:
df_reviews.head(2)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,7202016,38917982,7/19/2015,28943674,Bianca,Cute and cozy place. Perfect location to every...
1,7202016,39087409,7/20/2015,32440555,Frank,Kelly has a great room in a very central locat...

#### Observations:

Ở dataframe 1: Cột price có giá trị kí tự đặc biệt là $, cách giải quyết là xóa nó đi

### Issue 2:

In [159]:
#FILL IN - Inspecting the dataframe visually
df_listing.describe()

,id,host_id,accommodates,bathrooms,bedrooms,beds,square_feet
count,3.818000e+03,3.818000e+03,3818.000000,3802.000000,3812.000000,3817.000000,97.000000
mean,5.550111e+06,1.578556e+07,3.349398,1.259469,1.307712,1.735394,854.618557
std,2.962660e+06,1.458382e+07,1.977599,0.590369,0.883395,1.139480,671.404893
min,3.335000e+03,4.193000e+03,1.000000,0.000000,0.000000,1.000000,0.000000
25%,3.258256e+06,3.275204e+06,2.000000,1.000000,1.000000,1.000000,420.000000
50%,6.118244e+06,1.055814e+07,3.000000,1.000000,1.000000,1.000000,750.000000
75%,8.035127e+06,2.590309e+07,4.000000,1.000000,2.000000,2.000000,1200.000000
max,1.034016e+07,5.320861e+07,16.000000,8.000000,7.000000,15.000000,3000.000000

In [160]:
#FILL IN - Inspecting the dataframe programmatically
df_listing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 21 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            3818 non-null   int64
 1   name                          3818 non-null   object
 2   summary                       3641 non-null   object
 3   space                         3249 non-null   object
 4   description                   3818 non-null   object
 5   host_id                       3818 non-null   int64
 6   host_name                     3816 non-null   object
 7   neighbourhood_group_cleansed  3818 non-null   object
 8   city                          3818 non-null   object
 9   country_code                  3818 non-null   object
 10  country                       3818 non-null   object
 11  property_type                 3817 non-null   object
 12  room_type                     3818 non-null   object
 13  accommodates                  3818 non-null   int64
 14  bathrooms                     3802 non-null   float64
 15  bedrooms                      3812 non-null   float64
 16  beds                          3817 non-null   float64
 17  bed_type                      3818 non-null   object
 18  amenities                     3818 non-null   object
 19  square_feet                   97 non-null     float64
 20  price                         3818 non-null   object
dtypes: float64(4), int64(3), object(14)
memory usage: 626.5+ KB

In [161]:
df_reviews.describe()

         listing_id            id   reviewer_id
count  8.484900e+04  8.484900e+04  8.484900e+04
mean   3.005067e+06  3.058765e+07  1.701301e+07
std    2.472877e+06  1.636613e+07  1.353704e+07
min    4.291000e+03  3.721000e+03  1.500000e+01
25%    7.946330e+05  1.725127e+07  5.053141e+06
50%    2.488228e+06  3.228809e+07  1.413476e+07
75%    4.694479e+06  4.457648e+07  2.762402e+07
max    1.024814e+07  5.873651e+07  5.281274e+07

In [162]:
df_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84849 entries, 0 to 84848
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   listing_id     84849 non-null  int64
 1   id             84849 non-null  int64
 2   date           84849 non-null  object
 3   reviewer_id    84849 non-null  int64
 4   reviewer_name  84849 non-null  object
 5   comments       84831 non-null  object
dtypes: int64(3), object(3)
memory usage: 3.9+ MB

#### Observations:

Ở data frame 1: Như ta đã thấy thì price không thể nào là object được, cách giải quyết là chuyển price về float.
Ở data frame 2: Các cột đang ở dạng int64 khác với df1 vì vậy phải chuyển tất cả int về float.

### Issue 3:

In [163]:
df_listing.duplicated().sum()

0

In [164]:
df_reviews.duplicated().sum()

0

In [165]:
df_listing.columns

Index(['id', 'name', 'summary', 'space', 'description', 'host_id', 'host_name',
       'neighbourhood_group_cleansed', 'city', 'country_code', 'country',
       'property_type', 'room_type', 'accommodates', 'bathrooms', 'bedrooms',
       'beds', 'bed_type', 'amenities', 'square_feet', 'price'],
      dtype='object')

In [166]:
df_reviews

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,7202016,38917982,7/19/2015,28943674,Bianca,Cute and cozy place. Perfect location to every...
1,7202016,39087409,7/20/2015,32440555,Frank,Kelly has a great room in a very central locat...
2,7202016,39820030,7/26/2015,37722850,Ian,"Very spacious apartment, and in a great neighb..."
3,7202016,40813543,8/2/2015,33671805,George,Close to Seattle Center and all it has to offe...
4,7202016,41986501,8/10/2015,34959538,Ming,Kelly was a great host and very accommodating ...
...,...,...,...,...,...,...
84844,3624990,50436321,10/12/2015,37419458,Ryan,The description and pictures of the apartment ...
84845,3624990,51024875,10/17/2015,6933252,Linda,We had an excellent stay. It was clean and com...
84846,3624990,51511988,10/20/2015,19543701,Jaime,"Gran ubicación, cerca de todo lo atractivo del..."
84847,3624990,52814482,11/2/2015,24445024,Jørgen,"Very good apartement, clean and well sized. Si..."
84848,9727246,56429621,12/13/2015,30860360,Stephanie,"Breanne was a great host. Check in was easy, s..."

#### Observations:

Ở data frame 1: Các cột 'summary', 'space', 'host_id', 'square_feet' thì không cần thiết thì có thể xóa đi.
Ở data frame 2: Các cột 'listing_id', 'reviewer_id' thì không cần thiết thì có thể xóa đi.

### Issue 4:

In [167]:
#FILL IN - Inspecting the dataframe visually
df_listing.isna().sum()

id                                 0
name                               0
summary                          177
space                            569
description                        0
host_id                            0
host_name                          2
neighbourhood_group_cleansed       0
city                               0
country_code                       0
country                            0
property_type                      1
room_type                          0
accommodates                       0
bathrooms                         16
bedrooms                           6
beds                               1
bed_type                           0
amenities                          0
square_feet                     3721
price                              0
dtype: int64

In [168]:
#FILL IN - Inspecting the dataframe programmatically
df_reviews.isna().sum()

listing_id        0
id                0
date              0
reviewer_id       0
reviewer_name     0
comments         18
dtype: int64

#### Observations:

Ở data frame 1: Có các cột có dữ liệu bị null. Các cột null ở có giá trị ít hơn 20 ta có thể giải quyết bằng cách xóa đi còn các cột null còn lại thì sẽ được xóa ở bước clean issue 2.
Ở data frame 2: Cột comments có dữ liệu bị null nhưng mà không đáng kể nên ta có thể xóa đi.

#### Observations:

Ở data frame 1: Các cột 'summary', 'space', 'host_id', 'square_feet' thì không cần thiết thì có thể xóa đi.
Ở data frame 2: Các cột 'listing_id', 'reviewer_id' thì không cần thiết thì có thể xóa đi.

## 3. Clean data
Clean the data to solve the 4 issues corresponding to data quality and tidiness found in the assessing step. 

Make copies of the datasets

In [169]:
#Copy df1
df_listing_copy = df_listing.copy()
df_listing_copy.head(2)

,id,name,summary,space,description,host_id,host_name,neighbourhood_group_cleansed,city,country_code,...,property_type,room_type,accommodates,bathrooms,bedrooms,beds,bed_type,amenities,square_feet,price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,Make your self at home in this charming one-be...,956883,Maija,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,$85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",Chemically sensitive? We've removed the irrita...,5177328,Andrea,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",NaN,$150.00

In [170]:
#Copy df2
df_reviews_copy = df_reviews.copy()
df_reviews_copy.head(2)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,7202016,38917982,7/19/2015,28943674,Bianca,Cute and cozy place. Perfect location to every...
1,7202016,39087409,7/20/2015,32440555,Frank,Kelly has a great room in a very central locat...

### **Issue 1: Xóa kí tự đặc biệt trong cột price**

In [171]:
#Xóa kí tự đặc biệt trong cột price
df_listing_copy['price'] = df_listing_copy['price'].str.replace('$', '')
df_listing_copy.head(2)

,id,name,summary,space,description,host_id,host_name,neighbourhood_group_cleansed,city,country_code,...,property_type,room_type,accommodates,bathrooms,bedrooms,beds,bed_type,amenities,square_feet,price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,Make your self at home in this charming one-be...,956883,Maija,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",Chemically sensitive? We've removed the irrita...,5177328,Andrea,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",NaN,150.00

Justification: *Đã xóa thành công*

### Issue 2: Ép kiểu dữ liệu

In [172]:
#Ép kiểu dữ liệu cho cột price của df1
# Lấy chỉ mục của các giá trị không thể chuyển đổi thành float
invalid_price_index = []
for idx, value in enumerate(df_listing_copy['price']):
    try:
        float(value)
    except ValueError:
        invalid_price_index.append(idx)

# Hiển thị các giá trị không hợp lệ
print("Invalid prices:")
print(df_listing_copy.loc[invalid_price_index])

# Xóa các giá trị không hợp lệ khỏi DataFrame
df_listing_copy = df_listing_copy.drop(index=invalid_price_index)

# Ép kiểu dữ liệu cho cột price thành float64
df_listing_copy['price'] = df_listing_copy['price'].astype(float)

Invalid prices:
           id                     name  \
3122  4825073  Cute Basement Apartment

                                                summary space  \
3122  2 bedroom fully finished basement apartment wi...   NaN

                                            description  host_id  host_name  \
3122  2 bedroom fully finished basement apartment wi...   632896  Christina

     neighbourhood_group_cleansed     city country_code  ... property_type  \
3122          Other neighborhoods  Seattle           US  ...         House

            room_type accommodates  bathrooms  bedrooms  beds  bed_type  \
3122  Entire home/apt            4        1.0       2.0   2.0  Real Bed

                                              amenities square_feet      price
3122  {"Wireless Internet","Free Parking on Premises...         NaN  1,000.00

[1 rows x 21 columns]

In [173]:
df_listing_copy['price'].dtype

dtype('float64')

In [174]:
#Ép kiểu các cột trong df 2 từ int về float
df_reviews_copy[['listing_id', 'id', 'reviewer_id']] = df_reviews_copy[['listing_id', 'id', 'reviewer_id']].astype('float64')

In [175]:
df_reviews_copy.dtypes

listing_id       float64
id               float64
date              object
reviewer_id      float64
reviewer_name     object
comments          object
dtype: object

Justification: Đã ép kiểu thành công ở cả 2 cột

### Issue 3: Xóa các cột không cần thiết

In [176]:
# Xóa các cột không cần thiết 'summary', 'space', 'host_id', 'square_feet'
df_listing_copy = df_listing_copy.drop(columns=['summary', 'space', 'host_id', 'square_feet'])

In [177]:
df_listing_copy.columns

Index(['id', 'name', 'description', 'host_name',
       'neighbourhood_group_cleansed', 'city', 'country_code', 'country',
       'property_type', 'room_type', 'accommodates', 'bathrooms', 'bedrooms',
       'beds', 'bed_type', 'amenities', 'price'],
      dtype='object')

In [178]:
# Xóa các cột không cần thiết 'listing_id', 'reviewer_id'
df_reviews_copy = df_reviews_copy.drop(columns=['listing_id', 'reviewer_id'])

In [179]:
df_reviews_copy.columns

Index(['id', 'date', 'reviewer_name', 'comments'], dtype='object')

Justifications: Đã xóa thành công

###  Issue 4: Xóa các dòng có giá trị null

In [180]:
#Xóa dòng có giá trị null ở df1
df_listing_copy = df_listing_copy.dropna()

In [181]:
#Kiểm tra
df_listing_copy.isna().sum()

id                              0
name                            0
description                     0
host_name                       0
neighbourhood_group_cleansed    0
city                            0
country_code                    0
country                         0
property_type                   0
room_type                       0
accommodates                    0
bathrooms                       0
bedrooms                        0
beds                            0
bed_type                        0
amenities                       0
price                           0
dtype: int64

In [182]:
# Xóa dòng có giá trị null ở df2
df_reviews_copy = df_reviews_copy.dropna()

In [183]:
#Kiểm tra
df_reviews_copy.isna().sum()

id               0
date             0
reviewer_name    0
comments         0
dtype: int64

Justification: Đã xóa thành công

### **Remove unnecessary variables and combine datasets if needed**

In [184]:
#FILL IN - Remove unnecessary variables and combine datasets

Remove unnecessary columns

In [185]:
#FILL IN - Remove unnecessary variables and combine dataset

Rename columns if needed

In [186]:
#Rename column if needed

#### Merge 2 dataset if needed

In [187]:
#Merge 2 dataset

## 4. Update your data store
Update the database/data store with the cleaned data

In [188]:
#FILL IN - saving data

#### SUBMISSION

After completion, export the notebook as an HTML file for the project submission using the File > Download as... > HTML or PDF menu option.

Submit file “my_Project.html” to Final Project includes:

    1. my_Project.html

## PROJECT 1 STOPS HERE



## PROJECT 2

## 5. Answer the research question

### **5.1:** Define and answer the research question

* Question 1:

In [189]:
#Visual 1 - FILL IN

Justifications

 Question 2:

In [190]:
#Visual 2 - FILL IN

Justifications

Question n:

Justifications

### **5.2:** Reflection

After all steps above, I have the clean datasets and answer the research questions.
By using research questions, We can know the number infected cases in states, the death rate and the anomaly data.

In the future, I will look into the anomaly of the death and I will calculate the number of increasing or decreasing infected cases.
Further more, I will check the data in some columns such

#### SUBMISSION

After completion, export the notebook as an HTML file for the project submission using the File > Download as... > HTML or PDF menu option.

Submit file “my_Project.zip” to Final Project includes:

    1. my_Project.html
    2. my _Project.ipynb